# Concat

In [38]:
# https://pandas.pydata.org/docs/user_guide/merging.html

In [2]:
import numpy as np
import pandas as pd

In [6]:
a = pd.read_csv('a.csv')

In [7]:
b = pd.read_csv('b.csv')

In [13]:
print(a)
print(b)

    A   B
0  10  20
1  30  40
    A   C
0  10  20
1  30  40

In [15]:
b

    A   C
0  10  20
1  30  40

In [16]:
pd.concat([a,b]) #simple stacking , not intelligent

    A     B     C
0  10  20.0   NaN
1  30  40.0   NaN
0  10   NaN  20.0
1  30   NaN  40.0

In [17]:
pd.concat([a,b] ,axis=0) #default is 0th axis

    A     B     C
0  10  20.0   NaN
1  30  40.0   NaN
0  10   NaN  20.0
1  30   NaN  40.0

In [20]:
data =pd.concat([a,b] ,axis=1)

In [19]:
# accessing the data after concat

In [22]:
type(data)

pandas.core.frame.DataFrame

In [25]:
data.size

8

In [26]:
data

    A   B   A   C
0  10  20  10  20
1  30  40  30  40

In [29]:
data.loc[:]

    A   B   A   C
0  10  20  10  20
1  30  40  30  40

In [31]:
data.iloc[:,1:3]

    B   A
0  20  10
1  40  30

In [32]:
pd.concat([a,b] ,axis=0 , join='inner') #will get the common coulmn

    A
0  10
1  30
0  10
1  30

In [33]:
pd.concat([a,b] ,axis=0 , join='outer') #outer will be default and it will give the union

    A     B     C
0  10  20.0   NaN
1  30  40.0   NaN
0  10   NaN  20.0
1  30   NaN  40.0

# merging

In [35]:
a.merge(b)

    A   B   C
0  10  20  20
1  30  40  40

In [37]:
pd.concat([a,b] ,axis=0 , join='outer')

    A     B     C
0  10  20.0   NaN
1  30  40.0   NaN
0  10   NaN  20.0
1  30   NaN  40.0